import numpy as np
import decision_tree

if __name__ == '__main__':
    X = np.array([
        ['青年', '否', '否', '一般'],
        ['青年', '否', '否', '好'],
        ['青年', '是', '否', '好'],
        ['青年', '是', '是', '一般'],
        ['青年', '否', '否', '一般'],
        ['中年', '否', '否', '一般'],
        ['中年', '否', '否', '好'],
        ['中年', '是', '是', '好'],
        ['中年', '否', '是', '非常好'],
        ['中年', '否', '是', '非常好'],
        ['老年', '否', '是', '非常好'],
        ['老年', '否', '是', '好'],
        ['老年', '是', '否', '好'],
        ['老年', '是', '否', '非常好'],
        ['老年', '否', '否', '一般'],
    ])
    y = np.array(['否', '否', '是', '是', '否', '否', '否',
                  '是', '是', '是', '是', '是', '是', '是', '否'])

    p = decision_tree.DecisionTree(0)
    p.fit(X, y)
    print(p.predict(np.array([[['青年', '否', '否', '一般']]])))
